---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.DuctSizes
source: html/51fc7c5c-7ced-fe24-8424-a55f6b6fdbdc.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizes

Class RbsDuctSizes being used to store the duct sizes

## Syntax (C#)
```csharp
public class DuctSizes : IEnumerable<MEPSize>,
	IDisposable
```